zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_syspm_v2.c
/***************************************************************************//**
* \file cy_syspm_v2.c
* \version 5.220
*
* This driver provides the source code for API power management.
*
********************************************************************************
* \copyright
* (c) 2016-2026, Infineon Technologies AG or an affiliate of
* Infineon Technologies AG.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device.h"
#include "cy_sysclk.h"

#if defined (CY_IP_MXS40SSRSS)

#include "cy_syspm.h"
#if  defined (CY_IP_MXS40SSRSS)
#include "cy_syspm_ppu.h"
#endif


/*******************************************************************************
*       Internal Functions
*******************************************************************************/
__WEAK void Cy_SysPm_Dsramoff_Entry(void);
static bool IsVoltageChangePossible(void);

#ifdef ENABLE_MEM_VOLTAGE_TRIMS
/* RAM and ROM Voltage TRIM functions */
static void SetMemoryVoltageTrims(cy_en_syspm_sdr_voltage_t voltage);
#endif /* ENABLE_MEM_VOLTAGE_TRIMS */

#if defined (CY_IP_MXS40SSRSS) && (CY_MXS40SSRSS_VER_1_2 > 0UL)
static void SetReadMarginTrimUlp(void);
static void SetReadMarginTrimLp(void);
static void SetReadMarginTrimMf(void);
static void SetReadMarginTrimOd(void);
static void SetWriteAssistTrimUlp(void);
static void SetWriteAssistTrimLp(void);
static void SetWriteAssistTrimMf(void);
static void SetWriteAssistTrimOd(void);
#endif

/*******************************************************************************
*       Internal Defines
*******************************************************************************/


#if defined (CY_IP_MXS40SSRSS) && (CY_MXS40SSRSS_VER_1_2 > 0UL)
/* The define for number of callback roots */
#define CALLBACK_ROOT_NR                (9U)

/* Define for transitional 1.0 V for the LDO regulator */
#define LDO_OUT_VOLTAGE_1_0V          (0x0CU)

/* Define for transitional 1.2 V for the LDO regulator */
#define LDO_OUT_VOLTAGE_1_2V          (0x1CU)

/* Define for transitional 1.1 V for the LDO regulator */
#define LDO_OUT_VOLTAGE_1_1V           (0x14U)

/* Define for an LDO stabilization delay to 1.0 V */
#define LDO_TO_1_0V_DELAY_US          (3U)

/* Define for an LDO regulator stabilization delay to 1.1 V */
#define LDO_TO_1_1V_DELAY_US          (3U)

/* Define for an LDO stabilization delay 1.2 V */
#define LDO_TO_1_2V_DELAY_US          (3U)

/* Mask for the RAM read assist bits */
#define SRSS_TRIM_RAM_CTL_RA_MASK                   ((uint32_t) 0x3U << 8U)

/* Wake up delay for LP mode */
#define SRSS_PWR_TRIM_WAKE_LP                   (0x50U)

/* Wake up delay for MF mode */
#define SRSS_PWR_TRIM_WAKE_MF                   (0x50U)

/* Wake up delay for OD mode*/
#define SRSS_PWR_TRIM_WAKE_OD                   (0x50U)

/* Mask for the RAM write check bits */
#define SRSS_TRIM_RAM_CTL_WC_MASK        (0x3UL << 10U)

#else
/* The define for number of callback roots */
#define CALLBACK_ROOT_NR                (7U)
#endif

/* The mask to unlock the Hibernate power mode */
#define HIBERNATE_UNLOCK_VAL                 ((uint32_t) 0x3Au << SRSS_PWR_HIBERNATE_UNLOCK_Pos)

/* The mask to set the Hibernate power mode */
#define SET_HIBERNATE_MODE                   ((HIBERNATE_UNLOCK_VAL |\
                                               SRSS_PWR_HIBERNATE_FREEZE_Msk |\
                                               SRSS_PWR_HIBERNATE_HIBERNATE_Msk))

/* The mask to retain the Hibernate power mode status */
#define HIBERNATE_RETAIN_STATUS_MASK         ((SRSS_PWR_HIBERNATE_TOKEN_Msk |\
                                               SRSS_PWR_HIBERNATE_MASK_HIBALARM_Msk |\
                                               SRSS_PWR_HIBERNATE_MASK_HIBWDT_Msk |\
                                               SRSS_PWR_HIBERNATE_POLARITY_HIBPIN_Msk |\
                                               SRSS_PWR_HIBERNATE_MASK_HIBPIN_Msk))

/** The mask for the Hibernate wakeup sources */
#define HIBERNATE_WAKEUP_MASK               ((SRSS_PWR_HIB_WAKE_CTL_HIB_WAKE_SRC_Msk |\
                                              SRSS_PWR_HIB_WAKE_CTL_HIB_WAKE_CSV_BAK_Msk |\
                                              SRSS_PWR_HIB_WAKE_CTL_HIB_WAKE_RTC_Msk |\
                                              SRSS_PWR_HIB_WAKE_CTL_HIB_WAKE_WDT_Msk))

/** The define to update the token to indicate the transition into Hibernate */
#define HIBERNATE_TOKEN                    ((uint32_t) 0x1BU << SRSS_PWR_HIBERNATE_TOKEN_Pos)

/* The wait time for transition into the minimum regulator current mode
*/
#define SET_MIN_CURRENT_MODE_DELAY_US        (1U)

/* The wait delay time that occurs before the active reference is settled.
*  Intermediate delay is used in transition into the normal regulator current
*  mode
*/
#define ACT_REF_SETTLE_DELAY_US              (6U)

/* The wait delay time that occurs after the active reference is settled.
*  Final delay is used in transition into the normal regulator current mode
*/
#define SET_NORMAL_CURRENT_MODE_DELAY_US     (1U)

/* The internal define of the tries number in the
* Cy_SysPm_SystemSetMinRegulatorCurrent() function
*/
#define WAIT_DELAY_TRIES                (100U)

/* The internal define of the tries number in the
* Cy_SysPm_SystemSetMinRegulatorCurrent() function
*/
#define CY_SYSPM_CBUCK_BUSY_RETRY_COUNT         (100U)
#define CY_SYSPM_CBUCK_BUSY_RETRY_DELAY_MS      (1U)

/* Define for ROM trim for 0.9V */
#define CPUSS_TRIM_ROM_VOLT_0_900         (0x00000012U)

/* Define for ROM trim for 1.0V */
#define CPUSS_TRIM_ROM_VOLT_1_000         (0x00000012U)

/* Define for ROM trim for 1.1V */
#define CPUSS_TRIM_ROM_VOLT_1_100         (0x00000013U)

