zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_syspm_v2.c
        #if defined (__FPU_USED) && (__FPU_USED == 1U)
            /* Enable back FPU if it was used for CM33 in case of DS-RAM/DS-OFF.
             *
             * This is not required for DS-RAM/DS-OFF  because device should goes to reset after __WFI.
             * If requirements for entering into DS-RAM/DS-OFF were not met (for example, active debug session),
             * the device will operate as in normal deep sleep mode.
             * Because of that FPU is re-enabling.
             */
        #if (!defined(CY_DISABLE_DEEP_SLEEP_RAM) && !defined(CY_DISABLE_DEEP_SLEEP_OFF))
            if(((uint32_t)CY_SYSPM_MODE_DEEPSLEEP_RAM == cbDeepSleepRootIdx) || ((uint32_t)CY_SYSPM_MODE_DEEPSLEEP_OFF == cbDeepSleepRootIdx))
        #elif !defined(CY_DISABLE_DEEP_SLEEP_RAM)
            if((uint32_t)CY_SYSPM_MODE_DEEPSLEEP_RAM == cbDeepSleepRootIdx)
        #elif !defined(CY_DISABLE_DEEP_SLEEP_OFF)
            if((uint32_t)CY_SYSPM_MODE_DEEPSLEEP_OFF == cbDeepSleepRootIdx)
        #endif /* (!defined(CY_DISABLE_DEEP_SLEEP_RAM) && !defined(CY_DISABLE_DEEP_SLEEP_OFF)) */
            {
                SCS_CPPWR &= ~(SCS_ENABLE_CPPWR_SU10_SU11);
                SCB->CPACR |= SCB_ENABLE_CPACR_CP10_CP11;
                __DSB();                   /* Ensure completion of memory access */
            }
        #endif /* defined (__FPU_USED) && (__FPU_USED == 1U) */

            /* Clear SCB_SCR_SLEEPDEEP flag */
            SCB_SCR &= (uint32_t) ~SCB_SCR_SLEEPDEEP_Msk;

            /* Call the registered callback functions with the CY_SYSPM_AFTER_DS_WFI_TRANSITION
            *  parameter
            */
            if (pmCallbackRoot[cbDeepSleepRootIdx] != NULL)
            {
                (void) Cy_SysPm_ExecuteCallback((cy_en_syspm_callback_type_t)cbDeepSleepRootIdx, CY_SYSPM_AFTER_DS_WFI_TRANSITION);
            }

            Cy_SysLib_ExitCriticalSection(interruptState);
        }
        if (retVal == CY_SYSPM_SUCCESS)
        {
            /* Call the registered callback functions with the CY_SYSPM_AFTER_TRANSITION
            *  parameter
            */
            if (pmCallbackRoot[cbDeepSleepRootIdx] != NULL)
            {
                (void) Cy_SysPm_ExecuteCallback((cy_en_syspm_callback_type_t)cbDeepSleepRootIdx, CY_SYSPM_AFTER_TRANSITION);
            }
        }
        else
        {
            /* Execute callback functions with the CY_SYSPM_CHECK_FAIL parameter to
            *  undo everything done in the callback with the CY_SYSPM_CHECK_READY
            *  parameter
            */
            if (pmCallbackRoot[cbDeepSleepRootIdx] != NULL)
            {
                (void) Cy_SysPm_ExecuteCallback((cy_en_syspm_callback_type_t)cbDeepSleepRootIdx, CY_SYSPM_CHECK_FAIL);
            }
        }
    }
    return retVal;
}

#if !defined(CY_DISABLE_DEEP_SLEEP_RAM)
cy_en_syspm_status_t Cy_SysPm_SetupDeepSleepRAM(cy_en_syspm_dsram_checks_t dsramCheck, uint32_t *dsramIntState)
{
    uint32_t cbDeepSleepRootIdx = (uint32_t) Cy_SysPm_GetDeepSleepMode();
    cy_en_syspm_status_t retVal = CY_SYSPM_SUCCESS;

    CY_ASSERT_L3(CY_SYSPM_IS_DSRAM_CHECK_VALID(dsramCheck));
    CY_ASSERT_L3(CY_SYSPM_IS_DEEPSLEEP_MODE_VALID(cbDeepSleepRootIdx));

    //Check if LPM is ready
    if(!Cy_SysPm_IsLpmReady())
    {
        retVal = CY_SYSPM_FAIL;
    }
    else
    {
        if(dsramCheck == CY_SYSPM_PRE_DSRAM)
        {
            /* Clear the Warm Boot Entry status Flag */
            Cy_SysLib_ClearDSRAMWarmBootEntryStatus();

            /* Call the registered callback functions with the CY_SYSPM_CHECK_READY
            *  parameter
            */
            if (pmCallbackRoot[cbDeepSleepRootIdx] != NULL)
            {
                retVal = Cy_SysPm_ExecuteCallback((cy_en_syspm_callback_type_t)cbDeepSleepRootIdx, CY_SYSPM_CHECK_READY);
            }

            /* The CPU can switch into the Deep Sleep power mode only when
            *  all executed registered callback functions with the CY_SYSPM_CHECK_READY
            *  parameter return CY_SYSPM_SUCCESS
            */
            if (retVal == CY_SYSPM_SUCCESS)
            {
                /* Call the registered callback functions with the
                * CY_SYSPM_BEFORE_TRANSITION parameter
                */
                *dsramIntState = Cy_SysLib_EnterCriticalSection();

                if (pmCallbackRoot[cbDeepSleepRootIdx] != NULL)
                {
                    (void) Cy_SysPm_ExecuteCallback((cy_en_syspm_callback_type_t)cbDeepSleepRootIdx, CY_SYSPM_BEFORE_TRANSITION);
                }
                    /* The CPU enters Deep Sleep mode upon execution of WFI/WFE
                     * use Cy_SysPm_SetDeepSleepMode to set various deepsleep modes TBD*/
                    SCB_SCR |= SCB_SCR_SLEEPDEEP_Msk;
                    __DSB();                   /* Ensure completion of memory access */

            }
            else
            {
                /* Execute callback functions with the CY_SYSPM_CHECK_FAIL parameter to
                *  undo everything done in the callback with the CY_SYSPM_CHECK_READY
                *  parameter
                */
                if (pmCallbackRoot[cbDeepSleepRootIdx] != NULL)
                {
                    (void) Cy_SysPm_ExecuteCallback((cy_en_syspm_callback_type_t)cbDeepSleepRootIdx, CY_SYSPM_CHECK_FAIL);
                }
            }
        }
        else
        {
            /* Clear SCB_SCR_SLEEPDEEP flag */
            SCB_SCR &= (uint32_t) ~SCB_SCR_SLEEPDEEP_Msk;

            /* Call the registered callback functions with the CY_SYSPM_AFTER_DS_WFI_TRANSITION
            *  parameter
            */
            if (pmCallbackRoot[cbDeepSleepRootIdx] != NULL)
            {
                (void) Cy_SysPm_ExecuteCallback((cy_en_syspm_callback_type_t)cbDeepSleepRootIdx, CY_SYSPM_AFTER_DS_WFI_TRANSITION);
            }

            Cy_SysLib_ExitCriticalSection(*dsramIntState);

            /* Call the registered callback functions with the CY_SYSPM_AFTER_TRANSITION
            *  parameter
            */
            if (pmCallbackRoot[cbDeepSleepRootIdx] != NULL)
            {
                (void) Cy_SysPm_ExecuteCallback((cy_en_syspm_callback_type_t)cbDeepSleepRootIdx, CY_SYSPM_AFTER_TRANSITION);
            }
        }
    }
    return retVal;
}
#endif /* !defined(CY_DISABLE_DEEP_SLEEP_RAM) */

