zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_syspm_v2.c
            retVal = CY_SYSPM_SUCCESS;
        }
        break;

        default:
            retVal = CY_SYSPM_FAIL;
        break;
    }

    return retVal;
}

cy_en_syspm_ldo_mode_t Cy_SysPm_LdoGetMode(void)
{
    cy_en_syspm_ldo_mode_t retVal;

    if (!Cy_SysPm_LdoIsEnabled())
    {
        retVal = CY_SYSPM_LDO_MODE_DISABLED;
    }
    else if (Cy_SysPm_SystemIsMinRegulatorCurrentSet())
    {
        retVal = CY_SYSPM_LDO_MODE_MIN;
    }
    else
    {
        retVal = CY_SYSPM_LDO_MODE_NORMAL;
    }

    return retVal;
}

bool Cy_SysPm_LdoIsEnabled(void)
{
    return ((0U != _FLD2VAL(SRSS_PWR_CTL2_LINREG_DIS, SRSS_PWR_CTL2)) ? false : true);
}

#if defined (CY_IP_MXS40SSRSS) && (CY_MXS40SSRSS_VER_1_2 > 0UL)

cy_en_syspm_status_t Cy_SysPm_LdoSetVoltage(cy_en_syspm_ldo_voltage_t voltage)
{
    CY_ASSERT_L1(CY_SYSPM_IS_LDO_VOLTAGE_VALID(voltage));

    cy_en_syspm_status_t retVal = CY_SYSPM_INVALID_STATE;

    /* Voltage change is possible only when the specific device revision
    * support registers modification.
    */
    if (IsVoltageChangePossible())
    {
        uint32_t interruptState;
        uint32_t trimVoltage;
        cy_en_syspm_ldo_voltage_t currVoltage = Cy_SysPm_LdoGetVoltage();

        interruptState = Cy_SysLib_EnterCriticalSection();

        if (CY_SYSPM_LDO_VOLTAGE_0_9V == voltage)
        {
            SRSS_PWR_TRIM_WAKE_CTL = _FLD2VAL(SFLASH_PWR_TRIM_WAKE_CTL_WAKE_DELAY_0P9V, SFLASH_PWR_TRIM_WAKE_CTL);

            trimVoltage =  SFLASH_LDO_0P9V_TRIM;

            /* Update read-write margin value for the ULP mode */
            SetReadMarginTrimUlp();
        }
        else if(CY_SYSPM_LDO_VOLTAGE_1_0V == voltage)
        {
            if (Cy_SysPm_SystemIsMinRegulatorCurrentSet())
            {
                SRSS_PWR_TRIM_WAKE_CTL = SRSS_PWR_TRIM_WAKE_MF;
            }
            else
            {
                SRSS_PWR_TRIM_WAKE_CTL = _FLD2VAL(SFLASH_PWR_TRIM_WAKE_CTL_WAKE_DELAY_1P0V, SFLASH_PWR_TRIM_WAKE_CTL);
            }

            trimVoltage = SFLASH_LDO_1P0V_TRIM;

            /* A delay for the supply to stabilize at the new higher voltage */
            Cy_SysLib_DelayUs(LDO_TO_1_0V_DELAY_US);

            if(currVoltage > CY_SYSPM_LDO_VOLTAGE_1_0V)
            {
                /* Update read-write margin value for the MF mode */
                SetReadMarginTrimMf();
            }
            else
            {
                /* Update write assist value for the MF mode */
                SetWriteAssistTrimMf();
            }
        }
        else if(CY_SYSPM_LDO_VOLTAGE_1_1V == voltage)
        {
            if (Cy_SysPm_SystemIsMinRegulatorCurrentSet())
            {
                SRSS_PWR_TRIM_WAKE_CTL = SRSS_PWR_TRIM_WAKE_LP;
            }
            else
            {
                SRSS_PWR_TRIM_WAKE_CTL = _FLD2VAL(SFLASH_PWR_TRIM_WAKE_CTL_WAKE_DELAY_1P1V, SFLASH_PWR_TRIM_WAKE_CTL);
            }

            trimVoltage = SFLASH_LDO_1P1V_TRIM;
            /* A delay for the supply to stabilize at the new higher voltage */
            Cy_SysLib_DelayUs(LDO_TO_1_1V_DELAY_US);

            if(currVoltage < CY_SYSPM_LDO_VOLTAGE_1_1V)
            {
                /* Update read-write margin value for the LP mode */
                SetReadMarginTrimLp();
            }
            else
            {
                /* Update write assist value for the LP mode */
                SetWriteAssistTrimLp();
            }
        }
        else
        {
            if (Cy_SysPm_SystemIsMinRegulatorCurrentSet())
            {
                SRSS_PWR_TRIM_WAKE_CTL = SRSS_PWR_TRIM_WAKE_OD;
            }
            else
            {
                SRSS_PWR_TRIM_WAKE_CTL = _FLD2VAL(SFLASH_PWR_TRIM_WAKE_CTL_WAKE_DELAY_1P2V, SFLASH_PWR_TRIM_WAKE_CTL);
            }

            trimVoltage = SFLASH_LDO_1P2V_TRIM;

            /* A delay for the supply to stabilize at the new higher voltage */
            Cy_SysLib_DelayUs(LDO_TO_1_2V_DELAY_US);

            /* Update write assist value for the OD mode */
            SetWriteAssistTrimOd();
        }

        /* The system may continue operating while the voltage on Vccd
        *  discharges to the new voltage. The time it takes to reach the
        *  new voltage depends on the conditions, including the load current
        *  on Vccd and the external capacitor size.
        */
        SRSS_PWR_TRIM_PWRSYS_CTL =
        _CLR_SET_FLD32U((SRSS_PWR_TRIM_PWRSYS_CTL), SRSS_PWR_TRIM_PWRSYS_CTL_ACT_REG_TRIM, trimVoltage);

        if (CY_SYSPM_LDO_VOLTAGE_0_9V == voltage)
        {
            /* Update write assist value for the ULP mode */
            SetWriteAssistTrimUlp();
        }
        else if(CY_SYSPM_LDO_VOLTAGE_1_0V == voltage)
        {
            /* A delay for the supply to stabilize at the new intermediate voltage */
            Cy_SysLib_DelayUs(LDO_TO_1_0V_DELAY_US);

            if(currVoltage > CY_SYSPM_LDO_VOLTAGE_1_1V)
            {
                /* Update write assist value for the MF mode */
                SetWriteAssistTrimMf();
            }
            else
            {
                /* Update read-write margin value for the MF mode */
                SetReadMarginTrimMf();
            }
        }
        else if(CY_SYSPM_LDO_VOLTAGE_1_1V == voltage)
        {
            /* A delay for the supply to stabilize at the new intermediate voltage */
            Cy_SysLib_DelayUs(LDO_TO_1_1V_DELAY_US);
            if(currVoltage > CY_SYSPM_LDO_VOLTAGE_1_1V)
            {
                /* Update write assist value for the LP mode */
                SetWriteAssistTrimLp();
            }
            else
            {
                /* Update read-write margin value for the LP mode */
                SetReadMarginTrimLp();
            }
        }
        else
        {
            /* A delay for the supply to stabilize at the new intermediate voltage */
            Cy_SysLib_DelayUs(LDO_TO_1_2V_DELAY_US);

            /* Update read-write margin value for the OD mode */
            SetReadMarginTrimOd();
        }

        Cy_SysLib_ExitCriticalSection(interruptState);
        retVal = CY_SYSPM_SUCCESS;
    }
    return retVal;
}

