zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_syspm_v2.c
}


cy_en_syspm_status_t Cy_SysPm_SetSRAMPwrMode(cy_en_syspm_sram_index_t sramNum, cy_en_syspm_sram_pwr_mode_t sramPwrMode)
{
    CY_ASSERT_L3(sramNum == CY_SYSPM_SRAM0_MEMORY);
    CY_ASSERT_L3((sramPwrMode == CY_SYSPM_SRAM_PWR_MODE_ON) || (sramPwrMode == CY_SYSPM_SRAM_PWR_MODE_OFF));

    CY_UNUSED_PARAM(sramNum);

    (void)Cy_SysPm_SetSRAMMacroPwrMode(CY_SYSPM_SRAM0_MEMORY, (uint32_t)CY_SYSPM_SRAM0_MACRO_0, sramPwrMode);
    (void)Cy_SysPm_SetSRAMMacroPwrMode(CY_SYSPM_SRAM0_MEMORY, (uint32_t)CY_SYSPM_SRAM0_MACRO_1, sramPwrMode);

    return CY_SYSPM_SUCCESS;
}

#if !defined(CY_DISABLE_DEEP_SLEEP_RAM)
/*This reset handler will be implemented as part of HCI ROM app*/
__WEAK void Cy_SysPm_Dsramoff_Entry(void)
{
    while(true) {}
}

cy_en_syspm_status_t Cy_SysPm_CpuEnterRAMOffDeepSleep(void)
{
    uint32_t interruptState;
    uint32_t cbDeepSleepRootIdx = (uint32_t) Cy_SysPm_GetDeepSleepMode();
    cy_en_syspm_status_t retVal = CY_SYSPM_SUCCESS;

    CY_ASSERT_L3(CY_SYSPM_IS_DEEPSLEEP_MODE_VALID(cbDeepSleepRootIdx));

    //Check if LPM is ready
    if(!Cy_SysPm_IsLpmReady())
    {
        retVal = CY_SYSPM_FAIL;
    }
    else
    {
        //TBD Check if PDCM Dependencies are set properly

        /* Call the registered callback functions with the CY_SYSPM_CHECK_READY
        *  parameter
        */
        if (pmCallbackRoot[cbDeepSleepRootIdx] != NULL)
        {
            retVal = Cy_SysPm_ExecuteCallback((cy_en_syspm_callback_type_t)cbDeepSleepRootIdx, CY_SYSPM_CHECK_READY);
        }

        /* The CPU can switch into the Deep Sleep power mode only when
        *  all executed registered callback functions with the CY_SYSPM_CHECK_READY
        *  parameter return CY_SYSPM_SUCCESS
        */
        if (retVal == CY_SYSPM_SUCCESS)
        {
            /* Call the registered callback functions with the
            * CY_SYSPM_BEFORE_TRANSITION parameter
            */
            interruptState = Cy_SysLib_EnterCriticalSection();
            if (pmCallbackRoot[cbDeepSleepRootIdx] != NULL)
            {
                (void) Cy_SysPm_ExecuteCallback((cy_en_syspm_callback_type_t)cbDeepSleepRootIdx, CY_SYSPM_BEFORE_TRANSITION);
            }
            /* The CPU enters Deep Sleep mode upon execution of WFI/WFE
             * use Cy_SysPm_SetDeepSleepMode to set various deepsleep modes TBD*/
            SCB_SCR |= SCB_SCR_SLEEPDEEP_Msk;
            __DSB();                   /* Ensure completion of memory access */

            /* Disable SRAM Macros to save power */
            (void)Cy_SysPm_SetSRAMMacroPwrModeInline(CY_SYSPM_SRAM0_MEMORY, (uint32_t)CY_SYSPM_SRAM0_MACRO_0, CY_SYSPM_SRAM_PWR_MODE_OFF);

            __WFI();

            /* Enable SRAM Macros as DEEPSLEEP_RAM might have failed if we reach this point */
            (void)Cy_SysPm_SetSRAMMacroPwrModeInline(CY_SYSPM_SRAM0_MEMORY, (uint32_t)CY_SYSPM_SRAM0_MACRO_0, CY_SYSPM_SRAM_PWR_MODE_ON);

            /* Clear SCB_SCR_SLEEPDEEP flag */
            SCB_SCR &= (uint32_t) ~SCB_SCR_SLEEPDEEP_Msk;

            /* Jump to HCI ROM app Reset handler */
            Cy_SysPm_Dsramoff_Entry();

            Cy_SysLib_ExitCriticalSection(interruptState);
        }
        else
        {
            /* Execute callback functions with the CY_SYSPM_CHECK_FAIL parameter to
            *  undo everything done in the callback with the CY_SYSPM_CHECK_READY
            *  parameter
            */
            if (pmCallbackRoot[cbDeepSleepRootIdx] != NULL)
            {
                (void) Cy_SysPm_ExecuteCallback((cy_en_syspm_callback_type_t)cbDeepSleepRootIdx, CY_SYSPM_CHECK_FAIL);
            }
        }
    }
    return retVal;
}
#endif /* !defined(CY_DISABLE_DEEP_SLEEP_RAM) */

void Cy_SysPm_TriggerSoftReset(void)
{
    SRSS_RES_SOFT_CTL = SRSS_RES_SOFT_CTL_TRIGGER_SOFT_Msk;
}

void Cy_SysPm_TriggerXRes(void)
{
    SRSS_RES_PXRES_CTL = SRSS_RES_PXRES_CTL_PXRES_TRIGGER_Msk;
}


#ifdef ENABLE_MEM_VOLTAGE_TRIMS
/*******************************************************************************
* Function Name: SetMemoryVoltageTrims
****************************************************************************//**
*
* This is the internal function that updates the trim values for the
* RAM and ROM. The trim update is done during transition of regulator voltage
* from higher to a lower one.
*
*******************************************************************************/
static void SetMemoryVoltageTrims(cy_en_syspm_sdr_voltage_t voltage)
{
    uint32_t ramVoltgeTrim = CPUSS_TRIM_RAM_CTL;
    uint32_t romVoltgeTrim = CPUSS_TRIM_ROM_CTL;

    CY_ASSERT_L3(CY_SYSPM_IS_SDR_TRIM_VOLTAGE_VALID(voltage));

    switch(voltage)
    {
        case CY_SYSPM_SDR_VOLTAGE_0_900V:
        {
            ramVoltgeTrim = CPUSS_TRIM_RAM_VOLT_0_900;
            romVoltgeTrim = CPUSS_TRIM_ROM_VOLT_0_900;
        }
        break;

        case CY_SYSPM_SDR_VOLTAGE_1_000V:
        {
            ramVoltgeTrim = CPUSS_TRIM_RAM_VOLT_1_000;
            romVoltgeTrim = CPUSS_TRIM_ROM_VOLT_1_000;
        }
        break;

        case CY_SYSPM_SDR_VOLTAGE_1_100V:
        {
            ramVoltgeTrim = CPUSS_TRIM_RAM_VOLT_1_100;
            romVoltgeTrim = CPUSS_TRIM_ROM_VOLT_1_100;
        }
        break;

        default:
        {
            CY_ASSERT_L2(false);
        }
        break;
    }

    CPUSS_TRIM_RAM_CTL = ramVoltgeTrim;
    CPUSS_TRIM_ROM_CTL = romVoltgeTrim;

}
#endif /* ENABLE_MEM_VOLTAGE_TRIMS */

#if defined (CY_IP_MXS40SSRSS) && (CY_MXS40SSRSS_VER_1_2 > 0UL)

/*******************************************************************************
* Function Name: SetReadMarginTrimUlp
****************************************************************************//**
*
* This is the internal function that updates the read-margin trim values for the
* RAM and ROM. The trim update is done during transition of regulator voltage
* from higher to a lower one.
*
*******************************************************************************/
static void SetReadMarginTrimUlp(void)
{
    SRSS_TRIM_RAM_CTL = (CY_SRSS_TRIM_RAM_CTL_ULP & ((uint32_t) ~SRSS_TRIM_RAM_CTL_RA_MASK)) |
                        (SRSS_TRIM_RAM_CTL & SRSS_TRIM_RAM_CTL_RA_MASK);

    SRSS_TRIM_ROM_CTL = CY_SRSS_TRIM_ROM_CTL_ULP;
}


