zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_syspm_v2.c
/*******************************************************************************
* Function Name: SetReadMarginTrimLp
****************************************************************************//**
*
* The internal function that updates the read-margin trim values for the
* RAM and ROM. The trim update is done during transition of regulator voltage
* from a lower to a higher one.
*
*******************************************************************************/
static void SetReadMarginTrimLp(void)
{
    SRSS_TRIM_RAM_CTL = (CY_SRSS_TRIM_RAM_CTL_LP & ((uint32_t) ~SRSS_TRIM_RAM_CTL_RA_MASK)) |
                        (SRSS_TRIM_RAM_CTL & SRSS_TRIM_RAM_CTL_RA_MASK);

    SRSS_TRIM_ROM_CTL = CY_SRSS_TRIM_ROM_CTL_LP;
}


/*******************************************************************************
* Function Name: SetReadMarginTrimMf
****************************************************************************//**
*
* The internal function that updates the read-margin trim values for the
* RAM and ROM. The trim update is done during transition of regulator voltage
* from a lower to a higher one.
*
*******************************************************************************/
static void SetReadMarginTrimMf(void)
{
    SRSS_TRIM_RAM_CTL = (CY_SRSS_TRIM_RAM_CTL_MF & ((uint32_t) ~SRSS_TRIM_RAM_CTL_RA_MASK)) |
                        (SRSS_TRIM_RAM_CTL & SRSS_TRIM_RAM_CTL_RA_MASK);

    SRSS_TRIM_ROM_CTL = CY_SRSS_TRIM_ROM_CTL_MF;
}


/*******************************************************************************
* Function Name: SetReadMarginTrimOd
****************************************************************************//**
*
* The internal function that updates the read-margin trim values for the
* RAM and ROM. The trim update is done during transition of regulator voltage
* from a lower to a higher one.
*
*******************************************************************************/
static void SetReadMarginTrimOd(void)
{
    SRSS_TRIM_RAM_CTL = (CY_SRSS_TRIM_RAM_CTL_OD & ((uint32_t) ~SRSS_TRIM_RAM_CTL_RA_MASK)) |
                        (SRSS_TRIM_RAM_CTL & SRSS_TRIM_RAM_CTL_RA_MASK);

    SRSS_TRIM_ROM_CTL = CY_SRSS_TRIM_ROM_CTL_OD;
}


/*******************************************************************************
* Function Name: SetWriteAssistTrimUlp
****************************************************************************//**
*
* The internal function that updates the write assistant trim value for the
* RAM. The trim update is done during transition of regulator voltage
* from higher to a lower.
*
*******************************************************************************/
static void SetWriteAssistTrimUlp(void)
{
    SRSS_TRIM_RAM_CTL = (CY_SRSS_TRIM_RAM_CTL_HALF_ULP & ((uint32_t) ~SRSS_TRIM_RAM_CTL_RA_MASK)) |
                        (SRSS_TRIM_RAM_CTL & SRSS_TRIM_RAM_CTL_RA_MASK);
}


/*******************************************************************************
* Function Name: SetWriteAssistTrimLp
****************************************************************************//**
*
* The internal function that updates the write assistant trim value for the
* RAM. The trim update is done during transition of regulator voltage
* from lower to a higher one.
*
*******************************************************************************/
static void SetWriteAssistTrimLp(void)
{
    SRSS_TRIM_RAM_CTL = (CY_SRSS_TRIM_RAM_CTL_HALF_LP & ((uint32_t) ~SRSS_TRIM_RAM_CTL_RA_MASK)) |
                        (SRSS_TRIM_RAM_CTL & SRSS_TRIM_RAM_CTL_RA_MASK);

    SRSS_TRIM_ROM_CTL = CY_SRSS_TRIM_ROM_CTL_HALF_LP;
}


/*******************************************************************************
* Function Name: SetWriteAssistTrimMf
****************************************************************************//**
*
* The internal function that updates the write assistant trim value for the
* RAM. The trim update is done during transition of regulator voltage
* from lower to a higher one.
*
*******************************************************************************/
static void SetWriteAssistTrimMf(void)
{
    SRSS_TRIM_RAM_CTL = (CY_SRSS_TRIM_RAM_CTL_HALF_MF & ((uint32_t) ~SRSS_TRIM_RAM_CTL_RA_MASK)) |
                        (SRSS_TRIM_RAM_CTL & SRSS_TRIM_RAM_CTL_RA_MASK);

    SRSS_TRIM_ROM_CTL = CY_SRSS_TRIM_ROM_CTL_HALF_MF;
}


/*******************************************************************************
* Function Name: SetWriteAssistTrimOd
****************************************************************************//**
*
* The internal function that updates the write assistant trim value for the
* RAM. The trim update is done during transition of regulator voltage
* from lower to a higher one.
*
*******************************************************************************/
static void SetWriteAssistTrimOd(void)
{
    SRSS_TRIM_RAM_CTL = (CY_SRSS_TRIM_RAM_CTL_HALF_OD & ((uint32_t) ~SRSS_TRIM_RAM_CTL_RA_MASK)) |
                        (SRSS_TRIM_RAM_CTL & SRSS_TRIM_RAM_CTL_RA_MASK);

    SRSS_TRIM_ROM_CTL = CY_SRSS_TRIM_ROM_CTL_HALF_OD;
}
#endif

/*******************************************************************************
* Function Name: IsVoltageChangePossible
****************************************************************************//**
*
* The internal function that checks wherever it is possible to change the core
* voltage. Voltage change is possible only when the specific device revision
* support registers modification.
*
*******************************************************************************/
static bool IsVoltageChangePossible(void)
{

    bool retVal = false;
#if defined (CY_IP_MXS40SSRSS) && (CY_MXS40SSRSS_VER_1_2 > 0UL)

    uint32_t trimRamCheckVal = (SRSS_TRIM_RAM_CTL & SRSS_TRIM_RAM_CTL_WC_MASK);

    SRSS_TRIM_RAM_CTL &= ~SRSS_TRIM_RAM_CTL_WC_MASK;
    SRSS_TRIM_RAM_CTL |= ((~trimRamCheckVal) & SRSS_TRIM_RAM_CTL_WC_MASK);

    retVal = (trimRamCheckVal != (SRSS_TRIM_RAM_CTL & SRSS_TRIM_RAM_CTL_WC_MASK));

#elif (CY_SYSLIB_GET_SILICON_REV_ID != CY_SYSLIB_20829A0_SILICON_REV)
    {
        uint32_t trimRamCheckVal = (CPUSS_TRIM_RAM_CTL & CPUSS_TRIM_RAM_CTL_WC_MASK);

        CPUSS_TRIM_RAM_CTL &= ~CPUSS_TRIM_RAM_CTL_WC_MASK;
        CPUSS_TRIM_RAM_CTL |= ((~trimRamCheckVal) & CPUSS_TRIM_RAM_CTL_WC_MASK);

